// Задание 2: Манипуляции с DOM (1-1.5 часа)
//  1. Приложение для списка дел
//  Создайте простое приложение для списка задач, используя HTML, CSS и JavaScript.
//  Приложение должно включать следующие функции:
//  ● Текстовое поле для добавления новых задач.
//  ● Кнопка для добавления задачи в список.
//  ● Возможность отметить задачу как выполненную (по клику на нее).
//  ● Завершённая задача должна отличаться от незавершённой визуально.
//  ● Кнопкадля удаления задачи.
//  Требуется:
//  1. Манипулировать DOM для динамического добавления задач в список.
//  2. Обработать завершение и удаление задачи с помощью событий JavaScript.
//  Бонус: Добавьте возможность фильтрации задач (например, показать только
//  завершённые или незавершённые задачи)
import app from './application.js';

app();